<a href="https://colab.research.google.com/github/CottoneEnrico/python/blob/main/PANDAS_22_11_2022.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')
ilfile = pd.read_csv("/content/drive/MyDrive/appsheet/COTTONE ENRICO - titanic.csv", sep=";") #sep=";"

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [11]:
ilfile.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
len(ilfile["PassengerId"])

891

In [15]:
len(ilfile[ilfile["Survived"] > 0])

342

In [20]:
len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "male")])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

PassengerId    475.724771
Survived         1.000000
Pclass           2.018349
Age             27.276022
SibSp            0.385321
Parch            0.357798
Fare            40.821484
dtype: float64

In [29]:
len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "male")]) / len(ilfile[ilfile["Survived"] > 0]) * 100

31.871345029239766

In [30]:
len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "male")]) - len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "female")])

-124

In [31]:
len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "male")]) / len(ilfile[(ilfile["Survived"] > 0) & (ilfile["Sex"] == "female")]) * 100

46.78111587982833

In [47]:
ilfile[ilfile["Name"].str.contains("William")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
12,13,0,3,Saundercock; Mr. William Henry,male,20.0,0,0,A/5. 2151,8.0500,NaN,S
17,18,1,2,Williams; Mr. Charles Eugene,male,NaN,0,0,244373,13.0000,NaN,S
23,24,1,1,Sloper; Mr. William Thompson,male,28.0,0,0,113788,35.5000,A6,S
31,32,1,1,Spencer; Mrs. William Augustus (Marie Eugenie),female,NaN,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
802,803,1,1,Carter; Master. William Thornton II,male,11.0,1,2,113760,120.0000,B96 B98,S
810,811,0,3,Alexander; Mr. William,male,26.0,0,0,3474,7.8875,NaN,S
864,865,0,2,Gill; Mr. John William,male,24.0,0,0,233866,13.0000,NaN,S
880,881,1,2,Shelley; Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,Rice; Mrs. William (Margaret Norton),female,39.0,0,5,382652,29.1250,NaN,Q